// ประกาศ type สำหรับ Project ให้ใช้ร่วมกันได้ทั้งเว็บ
export type Project = {
  id: number;
  title: string;
  category: string;
  year: string;
  description: string;
  imageSrc: string; // path รูปใน public เช่น "/portfolio-1.jpg"
};

// ประกาศรายการผลงาน (คุณสามารถแก้/เพิ่มได้เองภายหลัง)
export const PROJECTS: Project[] = [
  {
    id: 1,
    title: "โครงการการพัฒนาเครือข่ายอาสาสมัครดิจิทัล (อสด.)",
    category: "Digital · Volunteer",
    year: "2025",
    description:
      "ที่ปรึกษาโครงการพัฒนาเครือข่ายอาสาสมัครดิจิทัล (อสด.) เป็นการพัฒนาประชาชนที่มีจิตอาสาที่มีความสนใจด้านดิจิทัล เพื่อเป็นตัวแทนในการทำหน้าที่ช่วยเหลือ ให้คำแนะนำภารกิจที่สำคัญของกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคมที่ดำเนินการในพื้นที่",
    imageSrc: "/images/project-1.jpg",
  },
  {
    id: 2,
    title: "กิจกรรมค่ายเยาวชนไซเบอร์ (Cyber Youth Camp)",
    category: "Cyber · Youth Camp",
    year: "2024",
    description:
      "ออกแบบและจัดอบรม Cyber Youth Camp เป็นค่ายพัฒนาเยาวชนที่ออกแบบมาเพื่อสร้าง “พลเมืองดิจิทัลที่เข้มแข็ง” ผ่านประสบการณ์การเรียนรู้ด้านความปลอดภัยไซเบอร์ การรู้เท่าทันข้อมูล การคิดวิเคราะห์ และการใช้เทคโนโลยีอย่างสร้างสรรค์ โดย ผสานกิจกรรมเชิงปฏิบัติจริงกับสถานการณ์จำลอง เพื่อให้เยาวชนพร้อมเผชิญโลกออนไลน์ที่เปลี่ยนแปลงอย่างรวดเร็ว",
    imageSrc: "/images/project-2.jpg",
  },
  {
    id: 3,
    title: "กิจกรรมยกระดับสมรรถนะประชากรเพื่อให้พร้อมเข้าสู่การเป็นพลเมืองดิจิทัล",
    category: "MILDL · Digital Literacy",
    year: "2025",
    description:
      "ออกแบบและจัดอบรมเพื่อให้ความรู้และทักษะที่จำเป็นในการใช้ชีวิตในโลกดิจิทัลอย่างปลอดภัยและชาญฉลาด โดยเน้นที่การสร้างพลเมืองดิจิทัลที่มีความสามารถในการรับมือกับความท้าทายและคว้าโอกาสในยุคดิจิทัล ",
    imageSrc: "/images/project-3.jpg",
  },
  {
    id: 4,
    title: "ข้อมูลระบบลงทะเบียนฉีดวัคซีน ซิโนฟาร์ม องค์การบริหารส่วนจังหวัดสมุทรปราการ",
    category: "Visualization · Dashboard",
    year: "2021",
    description:
      "ออกแบบระบบลงทะเบียนฉีดวัคซีนซิโนฟาร์ม ขององค์การบริหารส่วนจังหวัดสมุทรปราการ เป็นระบบดิจิทัลที่จัดทำขึ้นเพื่อรองรับการลงทะเบียน การคัดกรอง และการบริหารจัดการข้อมูลผู้ประสงค์รับวัคซีน ภายใต้การดำเนินงานเชิงรุกเพื่อเพิ่มประสิทธิภาพการบริการสุขภาพให้แก่ประชาชน พร้อมทั้งเพิ่มความโปร่งใส ลดความซ้ำซ้อน และรองรับปริมาณผู้ใช้ในระดับสูง",
    imageSrc: "/images/project-4 (5).jpg",
  },
  {
    id: 5,
    title: "ข้อมูลสถานภาพการรู้เท่าทันสื่อสารสนเทศ และการเข้าใจดิจิทัล ประจำปี พ.ศ. 2568",
    category: "Visualization · Dashboard",
    year: "2025",
    description:
      "ออกแบบรายงาน “สถานภาพการรู้เท่าทันสื่อสารสนเทศและการเข้าใจดิจิทัล 2568” นำเสนอภาพรวมระดับทักษะดิจิทัลของประชาชนไทย ทั้งด้านการวิเคราะห์ข้อมูล การตรวจสอบข่าวสาร ความปลอดภัยไซเบอร์ และการใช้เทคโนโลยีอย่างรับผิดชอบ เพื่อสะท้อนสถานการณ์จริงและเป็นแนวทางพัฒนาศักยภาพประชาชนในยุคดิจิทัล",
    imageSrc: "/images/project-5.jpg",
  },

];
